cf_billing/Enums/энргВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьэнргПерерасчет_КорректировкаПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_ВосстановлениеИзЗабалансаФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_СписаниеНаЗабалансФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ИзменениеКатегорииЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ОтменаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_РегистрацияЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_РегистрацияПоСтроению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ЗакрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ОткрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_СменаСобственника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ОтключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ПодключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Закрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Открытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ВозвратСредствПотребителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_НеправильноРаспределеннаяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ПереносМеждуЛицевымиСчетами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_БлокировочныйАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаПотребленногоОбъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_СвязанныеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Извещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РешениеСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ЗакрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОтключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОткрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ПодключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПерерасчетНенадлежащегоКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПереносВозвратОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_МассовоеСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОграничениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ВозобновлениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Вмешательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РаспределениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_ПериодОтсутствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/ВводНаОснованииБиллингКлиент/Ext/Module.bsl
#Область СозданиеПерерасчет

Функция ОткрытиеЛицевогоСчетаНаОснованииЗакрытияЛС(ОписаниеКоманды) Экспорт 
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) 
			И СсылкаДок.ВидОперации <> ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", СсылкаДок);
	ОткрытьФорму("Документ.энргОперацияСЛицевымСчетом.Форма.ФормаДокументаОткрытиеЛС", ПараметрыФормы);	
КонецФункции

Функция ПерерасчетНаОснованиииОперацияСЛицевымСчетом(ОписаниеКоманды) Экспорт  
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.бестВидыОпераций.Перерасчет_РучнойПерерасчет"));
	ПарамФормы.Вставить("Основание", СсылкаДок);

	ОткрытьФорму("Документ.бестПерерасчетНП.Форма.ФормаДокументаРучнойПерерасчет", ПарамФормы);
КонецФункции

Функция ПерерасчетНаОснованиииОперацииСЛС(ОписаниеКоманды) Экспорт  
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_СвязанныйПерерасчет"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	Если ЗначениеЗаполнено(ПарамФормы.Абонент) Тогда
		ЛицевойСчет = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПарамФормы.Абонент, "ЛицевойСчет");
		ПарамФормы.Вставить("ЛицевойСчет", ЛицевойСчет);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПарамФормы.КлючПомещения) Тогда
		Строение = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПарамФормы.КлючПомещения, "Строение");
		ПарамФормы.Вставить("Строение", Строение);
	КонецЕсли;

	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаСвязанныйПерерасчет", ПарамФормы);
КонецФункции

Функция ПерерасчетНаОснованиииОперацияСПриборомУчета(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииОперацияСУслугами(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьВидБлагоустройстваАбонента(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьГруппуПотребителейАбонента(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьЗначениеПлощади(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьКоличествоКомнат(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьКоличествоПрописанных(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьКоличествоСобственников(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции 

Функция ПерерасчетНаОснованиииУстановитьКоличествоПроживающих(ОписаниеКоманды) Экспорт  
	
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПарамФормы = Новый Структура("Организация, Район, Договор, Абонент, КлючПомещения"); 
	энргОбщегоНазначения.ПолучитьЗначенияРеквизитов("Документ", СсылкаДок, ПарамФормы);
	
	ПарамФормы.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета"));
	ПарамФормы.Вставить("Основание", СсылкаДок);
	
	ОткрытьФорму("Документ.энргПерерасчет.Форма.ФормаДокументаИзменениеПараметраРассчета", ПарамФормы);
	
КонецФункции

Функция ПерерасчетНаОснованиииУстановитьФормулуРасчетаТочекУчета(ОписаниеКоманды) Экспорт  
		
	ОбъектыОснований 			= ОписаниеКоманды.ОбъектыОснований;
	Если ОбъектыОснований.Количество() = 0 Тогда
		ТекстСообщения  		= НСтр("ru = 'Для выбранного документа перерасчет не требуется'");
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ТекстСообщения);
		Возврат Неопределено;			
	КонецЕсли;
	
	ДанныеДляПерерасчета 		= энргРаботаСПериодомДействия.ЗаполнитьДанныеДляПерерасчета(ОбъектыОснований[0],"ТочкиУчета"); 
	
	Если НЕ ДанныеДляПерерасчета = Неопределено тогда
		энргРаботаСПериодомДействияКлиент.ОткрытьФормуДокументаПерерасчет(ДанныеДляПерерасчета);		
	КонецЕсли;
	
КонецФункции

Функция РасходныйКассовыйОрдерНаОснованииПерерасчет(ОписаниеКоманды) Экспорт 
	СсылкаДок = Неопределено;
	Если СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаСписка") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Элементы.Список.ТекущаяСтрока;
	ИначеЕсли СтрНайти(ОписаниеКоманды.Форма.ИмяФормы, "ФормаДокумента") <> 0 Тогда
		СсылкаДок = ОписаниеКоманды.Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаДок) Тогда			
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", СсылкаДок);
	ОткрытьФорму("Документ.энргРасходныйКассовыйОрдер.Форма.ФормаДокумента", ПараметрыФормы);	
КонецФункции

#КонецОбласти
